package level_1_intern_;
/*

Создайте класс робот (Robot).

Научите вашего робота "говорить" привет.

Создайте в классе Robot метод со следующей сигнатурой:

    public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"
    }



 */
public class Robot {
    String name;
    public void sayHello() {
        System.out.println("Hello");







    }

}
