package student_mihails_nikolajevs.lesson_6.level_4_junior_;

import teacher.annotations.CodeReview;

/*
Создайте класс WhileInfiniteLoop и в нём напишите бесконечный
цикл при помощи цикла while.

Создайте класс ForInfiniteLoop и в нём напишите бесконечный
цикл при помощи цикла for.
 */
@CodeReview(approved = true)
public class WhileInfiniteLoop {

    public static void main(String[] args) {

        while (true) {

            System.out.println(" INFINITY ");
        }
    }
}
