package student_rolands_gudels.lesson_7_encapsulation.level_5_middle;

public class Task_9 {
 /*   Разработать класс PowerCalculator, который реализует единственный метод
    для возведения заданного числа в указанную степень.
    Название метода, список параметров и тип возвращаемого значения
    придумайте самостоятельно согласно условию задачи.
    Математическую операцию реализовать с использованием цикла.
    Написать тестовые сценарии для класса PowerCalculator в классе PowerCalculatorTest.
    Все тестовые сценарии должны отрабатывать без ошибок.*/
}
