package student_mihails_nikolajevs.lesson_12_exceptions_.level_4_junior_;
// Прочьтите главу 7 "Обработка ошибок" из книги Роберта Мартина "Чистый код".

public class Task_23 {
    //  Роберт Мартин, Чистый код, Глава 7, Обработка ошибок, Заключение.

 //     Чистый код хорошо читается, но он также должен быть надежным. Эти цели не конфликтуют друг с другом.
 //   Чтобы написать надежный и чистый код, следует рассматривать обработку ошибок как отдельную задачу,
 //   решаемую независимо от основной логики программы. В зависимости от того, насколько нам это удастся,
 //   мы сможем прорабатывать ее реализацию независимо от основной логики программы,
 //   а это окажет существенное положительное влияние на удобство сопровождения нашего кода.

}
