package student_mihails_nikolajevs.lesson_2_var.level_7_senior_;
/*
При написании Java кода для названий классов принято использовать
        нотацию под названием CamelCase (с англ. — «ВерблюжийРегистр»,
        также «ГорбатыйРегистр», «СтильВерблюда») — стиль написания
        составных слов, при котором несколько слов пишутся слитно без пробелов,
        при этом каждое слово внутри фразы пишется с прописной буквы.
        Стиль получил название CamelCase, поскольку прописные буквы
        внутри слова напоминают горбы верблюда (англ. Camel).

        Так же в Java принято в названии класса первую букву
        делать всегда заглавной. Компилятор и синтаксис языка Java
        это не требуют, но чёткое следование этому правилу сильно облегчает
        чтение программ.

        Задание: дайте правильные с точки зрения Java кода названия классам:

        book
        Bankaccount
        systemUnit
        Login_Service
        banktransaction
        task1



 */
public class RightNamesOfClasses {

    public static void main(String[] args) {

        System.out.println("Correct Names Of The Classes:");

        System.out.println("Book");
        System.out.println("BankAccount");
        System.out.println("SystemUnit");
        System.out.println("LoginService");
        System.out.println("BankTransaction");
        System.out.println("Task1");



    }


}
