package student_mihails_nikolajevs.lesson_2_var.level_7_senior_;
/*
Напишите программу и продемонстрируйте в ней использование
однострочного и многострочного коментариев.

Это простой пример программы на Java.
Вывод на консоль выражения " Типы различных комментариев "
на Английском языке.

 */
public class UsingOfComments {

    public static void main(String[] args) {  // Выполнение любой программы на Java
                                              // начинается с вызова метода main()


        System.out.println(" Types Of Different Comments. ");
    }

}
