package student_andrei_karamnov.lesson_6_arrays_while_loop.level_4_junior;
/*Создайте класс ForInfiniteLoop и в нём напишите бесконечный
цикл при помощи цикла for.*/
class ForInfiniteLoop {
    public static void main(String[] args) {
        for (; ;) {
            System.out.println("ForInfiniteLoop");
            
        }
    }
}
