package student_eduards_puzirevskis.lesson_2_variables.level_2_intern;
/*
Дан код, нужно сделать этот код запускаемым.
Для сдачи работы создайте исправленный класс.

class LoginService {

	public void main(String[] args) {
		System.out.println("You can login!");
	}


}
 */
public class LoginService {
    public static void main(String[] args) {
        System.out.println("You can login!");
    }
}
