package student_rolands_gudels.lesson_3_oop_first_look.level_2_intern;

class Task_8 {
    /*Учимся работать со строками.

Тема: Конкатенация строк.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль приветствие типа "Hi YourName".

Подсказка: любые две строки можно соединять знаком "+".

    String userName = "Viktor";
    String greeting = "Hi " + userName + "!";*/

    public static void main(String[] args) {
        String myName = "Roland";
        System.out.println("Hi " +myName);
    }
}
