package student_rolands_gudels.lesson_3_oop_first_look.level_2_intern;

public class Task_7 {
    /*Учимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.

Пример кода:

    String myName = "Viktor";
    System.out.println(myName);*/

    public static void main(String[] args) {
        String myName = "Roland";
        System.out.println(myName);
    }
}
