package student_stanislav_p.Lesson_2.level_2_intern;
/*
Дан код, нужно сделать этот код запускаемым.
Для сдачи работы создайте исправленный класс.

class LoginService {

	public void main(String[] args) {
		System.out.println("You can login!");
	}


}

 */
public class Lesson2_Task_7 {

   static class LoginService {

        static public void main(String[] args) {
            System.out.println("You can login!");
        }


    }

}