package student_andrei_karamnov.lesson_5_arrays_for_loop.level_2_intern;

import java.util.Arrays;

/*Напишите программу, в которой:
 - создайте массив целых чисел длиной 3,
 - заполните каждую ячейку массива любым целым числом,
 - выведите значение каждой ячейки на консоль.*/
class Task_10 {
    public static void main(String[] args) {
        int[] myArray = new int []{0, 1, 2, 3};{
            System.out.println("My array: " + Arrays.toString(myArray));
        }
    }

}
