package student_stanislav_p.Lesson_2.level_5_middle;

/*
Команда System.out.println("text"); выводит указанный "text"
на консоль, и переводит курсор на новую строку.

Для того, что бы выводить текст на консоль без перевода курсора на
новую строку можно воспользоваться командой
    System.out.print("text");
эта команда распечатает текст на консоль и оставит курсор в той же строке.

Напишите программу, которая демонстрирует использование команды
    System.out.print("text");
 */

public class Lesson2_Task_15 {

    public static void main(String [] args) {


         System.out.print("Пример использования команды System.out.print");



        System.out.println("  и Пример использования команды System.out.println");
        System.out.println("  Второй Пример использования команды System.out.println");
    }

}