package student_mihails_nikolajevs.lesson_9.level_3_junior_.task_6_;

interface MyValue {
    double getValue();
}
/*
       Функциональный интерфейс - это интерфейс , который содержит один и только один абстрактный метод.
Обычно подобный метод определяет предпологагаемое назначение интерфейса.Таким образом , функц. интерфейс ,
представляет как правило,какое то одно действие.
       В данном примере метод getValue() неявно задан как абстрактный и является единственным методом ,
определяемым интерфейсом MyValue .
       Следовательно ,  MyValue - функциональный интерфейс , и его функция определена как getValue() .

 */