package student_eduards_puzirevskis.lesson_5_arrays_for_loop.level_2_intern;
/*
Напишите программу, в которой:
 - создайте массив целых чисел длиной 3,
 - заполните каждую ячейку массива любым целым числом,
 - выведите значение каждой ячейки на консоль.
 */
class Task_10 {
    public static void main(String[] args) {
        int[] firstArray = {1,9,17};
        System.out.println(firstArray[0]);
        System.out.println(firstArray[1]);
        System.out.println(firstArray[2]);

    }
}
