package student_rolands_gudels._lesson_11_collections.level_3_junior;

public class Task_22 {
 /*   Продолжаем разработку интерфейса BookDatabase.

    В интерфейсе BookDatabase создайте следующий метод:

    List<Book> find(SearchCriteria searchCriteria);

    Данный метод должен находить и возвращать все книги в библиотеке,
    которые подходят под указанное в качестве параметра условие.

    С помощью такого метода в базе данных можно будет искать книги используя
    для поиска сложные условия.

    Реализуйте и протестируйте данный метод.*/
}
