package student_rolands_gudels.lesson_8_inheritance.level_3_junior;

public class Task_10 {
  /*  Что такое абстрактный класс?  это максимально абстрактная, о-о-о-чень приблизительная «заготовка» для группы
  будущих классов. Эту заготовку нельзя использовать в готовом виде — слишком «сырая». Но она описывает некое общее
  состояние и поведение, которым будут обладать будущие классы — наследники абстрактного класса.

    Можно ли создать экземпляр абстрактного класса
    в момент выполнения программы?

    нельзя создать объект или экземпляр абстрактного класса*/
}
