package student_eduards_puzirevskis.lesson_8_inheritance.level_3_junior;

import teacher.annotations.CodeReview;

@CodeReview(approved = true)
class Task_10 {
/*
  Что такое абстрактный класс?
  Можно ли создать экземпляр абстрактного класса
  в момент выполнения программы?
  /*
  Абстрактный класс это просто "чертеж", наследуясь ль которых будут создаваться уже нормальные классы.
  Это общие наброски, которые могут быть одинаковы для классов-наследников.
  Создать экземпляр абстрактного класса нельзя.
 */

}
