package student_andrei_karamnov.lesson_3_oop_first_look.level_2_intern;
/*чимся работать со строками.

Тема: создание переменной типа String.

Напишите программу в которой создайте переменную
типа String и присвойте ей в качестве начального значения
ваше имя. Выведете на консоль значение этой переменной.

Пример кода:

    String myName = "Viktor";
    System.out.println(myName);*/
public class Task_7 {

    public static void main(String[] args) {
        String myName = "Andrei";
        System.out.println(myName);
    }


}
