package student_stanislav_p.lesson_8_inheritance.homework.level_7_senior.library;
/*

Разработать доменную модель для электронной системы управления библиотекой.
Доменная модель должна в будущем давать возможность поддерживать следующие операции:
- взять книгу из библиотеки;
- вернуть книгу в библиотеку;
- поиск нужной книги;
- резервация книги;
- рассылка оповещений читателям о сроке сдачи книги в библиотеку;
- выписывание штрафов за вовремя не сданные книги;
- добавление новой книги в библиотеку.
 */


public class Library {
    private int catalogNumber;
    private int authorIndex;
    private String [] nameOfTheBook;




}
