package Homework.lesson2_variables;

public class Task_7_LoginService {

    //Дан код, нужно сделать этот код запускаемым.
    //Для сдачи работы создайте исправленный класс.
    //
    //class LoginService {
    //
    //	public void main(String[] args) {
    //		System.out.println("You can login!");
    //	}
    //
    //
    //}

    public static void main(String[] args) {
        System.out.println("You can login!");
    }
}
