package student_rolands_gudels.lesson4_if_statement.level_7_senior;

class Task_22 {



        // Реализуйте следующие требования:
        // - если переданное число делится на три возвращайте "Fizz"
        // - если переданное число делится на пять возвращайте "Buzz"
        // - если переданное число делится на три и на пять возвращайте "FizzBuzz"
        // - иначе возвращайте само число в виде строки (подсказка: return "" +  number)




}
/*
Создайте класс FizzBuzzTest и напишите автоматические тесты,
которые покрывают все возможные сценарии.*/

