package student_rolands_gudels.lesson4_if_statement.level_7_senior;

class Task_22 {
    /*Создайте класс FizzBuzz.
В классе FizzBuzz создайте метод со следующей сигнатурой: */

/*class FizzBuzz {
int number;
    public String detect(int number) {
        this.number = number;
        if (number % 3 ==0) {
            System.out.println("Fizz");
        } else if (number % 5 ==0) {
            System.out.println("Buzz");
        } else if (number % 3 == 0 || number % 5 == 0) {
            System.out.println("FizzBuzz");
        } else return "" + number;
        }
        // Реализуйте следующие требования:
        // - если переданное число делится на три возвращайте "Fizz"
        // - если переданное число делится на пять возвращайте "Buzz"
        // - если переданное число делится на три и на пять возвращайте "FizzBuzz"
        // - иначе возвращайте само число в виде строки (подсказка: return "" +  number)
    }

}
/*
Создайте класс FizzBuzzTest и напишите автоматические тесты,
которые покрывают все возможные сценарии.*/
}
