package student_mihails_nikolajevs.lesson_8;
/*
то такое дефолтный конструктор
или как его еще называют конструктор по умолчанию?
Это конструктор без параметров, тело которого пустое.

Создайте класс DefaultConstructor и в нём
явно объявите дефолтный конструктор.

Создайте класс DefaultConstructorDemo и продемонстрируйте вызов
дефолтного конструктора из класса DefaultConstructor в main() методе.
 */
public class DefaultConstructor {

   public void DefaultConstructor() {

        System.out.println(" Empty Constructor ");
   }
}
