package student_eduards_puzirevskis.lesson_12_exeptions.level_4_junior;

import java.io.IOException;

class Task_24 {

     /*
     Найдите в документации Java (javadoc) для чего используются
следующие ошибки:

- ArrayIndexOutOfBoundsException
Это исключение возникает, когда программа пытается адресовать элементы за пределами массива.

- IllegalArgumentException
Оно случается, когда JVM пытается передать методу неподходящий аргумент или аргумент неправильного типа.

- IOException
Сигналы, что произошло исключение ввода-вывода некоторого вида.
Этот класс является общим классом исключений, произведенных отказавшими или прерванными операциями ввода-вывода.

- StackOverflowError.
StackOverflowError просто сигнализирует о том, что памяти больше нет.
Он расширяет класс VirtualMachineError, что указывает на то,
что JVM (виртуальная машина Java) повреждена или у нее закончились ресурсы и она не может работать.

- OutOfMemoryError.
OutOfMemoryError может быть при возникновении одного из следующих обстоятельств:
JVM не хватает родной памяти
Кучи Java не хватает памяти
PermGen или Metaspace не хватает памяти
JVM потратила слишком много времени, пытаясь собрать мусор

- NumberFormatException
Java бросает NumberFormatException – неконтролируемое исключение –
 когда он не может преобразовать строку в тип числа.


      */

}
