package student_eduards_puzirevskis.lesson_12_exeptions.level_4_junior;

 class Task_23 {

     //Прочтите главу 7 "Обработка ошибок" из книги Роберта Мартина "Чистый код".
/*
Чистый код хорошо читается, но он также должен быть надежным.
Эти цели не конфликтуют друг с другом.
Чтобы написать надежный и чистый код, следует рассматривать обработку
 ошибок как отдельную задачу, решаемую независимо от основной логики программы.
 В зависимости от того, насколько нам это удастся, мы сможем прорабатывать
  ее реализацию независимо от основной логики про-граммы,
  а это окажет существенное положительное влияние на удобство сопровождения нашего кода.
 */
}
