package student_eduards_puzirevskis.lesson_12_exeptions.level_3_junior;
/*
Создайте класс NullPointerExceptionDemo
и в main() методе этого класса напишите код,
который приводит к появлению NullPointerException.
В комментариях напишите, когда происходит NullPointerException.
 */
 class NullPointerExceptionDemo {

    public static void main(String[] args) {

//        Integer n1 = null;
//        System.out.println(n1.toString());

        /*
        NullPointerException это исключение,
        которое выбрасывается каждый раз, когда ты обращаешься
        к методу или полю объекта по ссылке, которая равна null.
         */

    }

}
