package student_rolands_gudels.homework.lesson2_variables.level_5;

import teacher.annotations.CodeReview;

@CodeReview(approved = true)
public class Task_16_QuickCommands {

    //При программировании более удобно и быстро выполнять все
    //действия с помощью клавиатуры, не переключаясь на мышку.
    //
    //Научитесь без мышки создавать новый класс!
    //
    //Alt (слева) + 1 - открывает окно Project в котором видна структура проекта.
    //
    //Вызывает всплывающее меню используя клавиатуру.
    //
    //Стрелочки: вверх, вниз, влево, вправо - помогают выбирать
    //нужный пункт меню.
    //
    //Enter - после введения названия нового класса.
    // Done

}
