package student_rolands_gudels.lesson_6_arrays_while_loop.level_4_junior;

import java.util.Scanner;

public class Task_18 {

    public static void main(String[] args) {
        Task_18 task_18 = new Task_18();
        //task_18.WhileInfiniteLoop();
       // task_18.ForInfiniteLoop();
    }

    public static void WhileInfiniteLoop() {
        boolean bad = true;
        while (bad) {
            System.out.println("b");
        }
    }

    public static void WhileInfiniteLoopBreak(){
       // {break;}
    }


            /*Создайте класс и в нём напишите бесконечный
    цикл при помощи цикла while.*/

    public void ForInfiniteLoop() {
        for (int i = 0; i <= 0; ) {
            System.out.println("test");
        }
    }/*Создайте класс  и в нём напишите бесконечный
    цикл при помощи цикла for.*/
}
 /*Создайте класс WhileInfiniteLoopBreak и в нём продемонстрируйте
    выход из бесконечного цикла реализованного при помощи цикла while.

    Создайте класс ForInfiniteLoopBreak и в нём продемонстрируйте
    выход из бесконечного цикла реализованного при помощи цикла for.*/
