package student_rolands_gudels.homework.lesson2_variables.level_6;

public class Task_20_PereklucenieKlassov {

    //При программировании более удобно и быстро выполнять все
    //действия с помощью клавиатуры, не переключаясь на мышку.
    //
    //Откройте несколько классов, у вас должны появиться
    //на каждый класс одна закладка в редакторе кода.
    //
    //Научитесь переключаться между открытыми классами без помощи мыши!
    //
    //Alt (слева) + стрелка влево
    //
    //Alt (слева) + стрелка вправо
    //Done

}
