package student_dmitrijs_sinkevics.lesson_2.lvl_7_senior;
/*
Напишите программу и продемонстрируйте в ней использование
        однострочного и многострочного коментариев.

 */

public class Task32 {
    public static void main(String[] args) {

        int numberOne = 10;
        // int numberTwo = 20;

        System.out.println("Number 1 = " + numberOne);
        // System.out.println("Number 2 = " + numberTwo);

    }
}